{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "activation": "linear", "trainable": true, "name": "conv2d_5", "dtype": "float32", "filters": 20, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "activation": "linear", "trainable": true, "name": "conv2d_6", "filters": 15, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 128, "trainable": true, "name": "dense_5", "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 10, "trainable": true, "name": "dense_6", "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_12"}}], "keras_version": "2.0.4"}